# урок 1
# задание 4  (Квадратное уравнение)
sqrt = 0.0
puts "Введите коэффициент а "
a = gets.chomp.to_f
puts "Введите коэффициент в "
b = gets.chomp.to_f
puts "Введите коэффициент с "
c = gets.chomp.to_f
d = b ** 2 - 4 * a * c # вычисляем дискриминант
puts "дискриминант = #{d}"
if d >= 0
sqrt = Math.sqrt(d)  # вычилсяем корень
x1 = (-b + sqrt ) / (2 * a)  # вычисляем корни уровнения
x2 = (-b - sqrt ) / (2 * a)
  puts "корень х1 = #{x1}, корень х2 = #{x2}" if d > 0
  puts "корень х = #{x2}" if d == 0
else
  puts "корней нет"
end
